handouts/jackknife2.tex
% Created 2011-08-26 Fri 16:03
\documentclass[11pt,english]{article}

\usepackage{color}
\usepackage{listings}
\input{handoutformat}
\providecommand{\alert}[1]{\textbf{#1}}

\title{The Jackknife, Part 2}
%\author{}
\date{STAT 5840: Summer 2011}

\begin{document}

\maketitle

\thispagestyle{empty}

\section*{Estimating standard error of a ratio estimator with the jackknife\footnote{Adapted from \emph{Statistical Computing with R} by Maria Rizzo (2008). }}
\label{sec-1}

We were talking about the \texttt{patch} data in the \texttt{bootstrap} package which concerns bloodstream measurements for eight subjects in a study. 



The parameter of interest was
\[
\theta = \frac{\E[\mathrm{new}] - \E[\mathrm{old}]}{\E[\mathrm{old}] - \E[\mathrm{placebo}]},
\]
which we estimated with the statistic \(\hat{\theta} = \overline{Y}/\overline{Z}\).  The following uses the jackknife to estimate the standard error of $\hat{\theta}$.


\begin{verbatim}
# jackknife2.R
n <- nrow(patch)
y <- patch$y
z <- patch$z
theta.hat <- mean(y)/mean(z)  # original value of statistic

theta.jack <- numeric(n)
for (i in 1:n){
  theta.jack[i] <- mean(y[-i]) / mean(z[-i])
}
bias <- (n - 1) * (mean(theta.jack) - theta.hat)
se <- sqrt((n-1) *
        mean((theta.jack - mean(theta.jack))^2))  # this is the new line
\end{verbatim}




After the copy-paste of the above we may look at our results with the following.

\begin{verbatim}
theta.hat
bias
se
bias/se
\end{verbatim}




\begin{verbatim}
 \protect\footnotemark[1] -0.0713061
 \footnotemark[1] 0.008002488
 \footnotemark[1] 0.1055278
 \footnotemark[1] 0.075833
\end{verbatim}

\end{document}